[
    {
        "title":"What is a computer?",
        "subtitle":"Computer is a things to calculate and fo any other works",
        "image_url":"https://cdn.pixabay.com/photo/2016/03/26/13/09/workspace-1280538_960_720.jpg",
        "detail":"A computer is a machine that can be programmed to carry out sequences of arithmetic or logical operations automatically. Modern computers can perform generic sets of operations known as programs. These programs enable computers to perform a wide range of tasks. A computer system is a \"complete\" computer that includes the hardware, operating system (main software), and peripheral equipment needed and used for \"full\" operation. This term may also refer to a group of computers that are linked and function together, such as a computer network or computer cluster."
    },
    {
        "title":"What is Flutter?",
        "subtitle":"Flutter is a tool to create a mobile application",
        "image_url":"https://cdn.pixabay.com/photo/2015/12/01/08/42/banner-1071789_960_720.jpg",
        "detail":"Flutter is an open-source UI software development kit created by Google. It is used to develop cross platform applications for Android, iOS, Linux, Mac, Windows, Google Fuchsia, and the web from a single codebase."
    },
    {
        "title":"Waht is Dart?",
        "subtitle":"Dart is the language used in Flutter",
        "image_url":"https://cdn.pixabay.com/photo/2016/12/31/16/52/dart-1943313_960_720.jpg",
        "detail":"Dart is a programming language designed for client development,[9][10] such as for the web and mobile apps. It is developed by Google and can also be used to build server and desktop applications."
    },
    {
        "title":"Waht is Mobile App?",
        "subtitle":"Dart is the language used in Flutter",
        "image_url":"https://cdn.pixabay.com/photo/2016/12/31/16/52/dart-1943313_960_720.jpg",
        "detail":"Dart is a programming language designed for client development,[9][10] such as for the web and mobile apps. It is developed by Google and can also be used to build server and desktop applications."
    }
    
]






